Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleHollowProfile
The IFC2X3_ParametricObject_CircleHollowProfile class contains the circular and hollow profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleHollowProfile.Radius
The radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleHollowProfile.WallThickness
The wall thickness.